#language: ru

@all
Функционал: Калькулятор

  @Sum
  Структура сценария: Подсчет суммы двух чисел
    * Получить первое число : <x>
    * Получить второе число : <y>
    * Получить сумму

    Примеры:
      | x    | y    |
      | 1    | 2    |
      | -100 | -200 |
      | 5.8  | 200  |
      | -3   | 0    |

  @Subtraction
  Структура сценария: Подсчет разности двух чисел
    * Получить первое число : <x>
    * Получить второе число : <y>
    * Получить разность

    Примеры:
      | x    | y    |
      | 1    | 2    |
      | -100 | -200 |
      | 5.8  | 200  |
      | -3   | 0    |

  @Division
  Структура сценария: Подсчет остатка от деления двух чисел
    * Получить первое число : <x>
    * Получить второе число : <y>
    * Получить остаток

    Примеры:
      | x    | y    |
      | 1    | 2    |
      | -100 | -200 |
      | 5.8  | 200  |
      | -3   | 0    |

  @Multiplication
  Структура сценария: Подсчет произведения двух чисел
    * Получить первое число : <x>
    * Получить второе число : <y>
    * Получить произведение

    Примеры:
      | x    | y    |
      | 1    | 2    |
      | -100 | -200 |
      | 5.8  | 200  |
      | -3   | 0    |